; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(pointing satellite1 Star9)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Star9 thermograph0)
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite1 planet13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 8
4. (take_image satellite1 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 1 of 8
6. (take_image satellite1 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 8
7. (turn_to satellite1 planet11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet11)
   goals met: 2 of 8
8. (take_image satellite1 planet11 instrument1 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 3 of 8
9. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 8
10. (take_image satellite1 phenomenon8 instrument1 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 4 of 8
11. (turn_to satellite1 planet7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet7)
   goals met: 4 of 8
12. (take_image satellite1 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 5 of 8
13. (turn_to satellite1 star10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star10)
   goals met: 5 of 8
14. (take_image satellite1 star10 instrument1 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 6 of 8
15. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 7 of 8
16. (take_image satellite1 star9 instrument1 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 8
